vent/vent_air_gap/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          312;
        startFace       12528;
    }
    side
    {
        type            patch;
        nFaces          624;
        startFace       12840;
    }
    outlet
    {
        type            patch;
        nFaces          312;
        startFace       13464;
    }
    defaultFaces
    {
        type            patch;
        nFaces          624;
        startFace       13776;
    }
)

// ************************************************************************* //
